# Pandas básico

In [53]:
import pandas as pd

## Series

In [54]:
#series
serie = pd.Series(index = ['pablo', 'ana', 'juan'], data = [100,200,300])
serie #se obtiene toda la serie

pablo    100
ana      200
juan     300
dtype: int64

In [55]:
serie.index #se obtienen los índices

Index(['pablo', 'ana', 'juan'], dtype='object')

In [56]:
serie['pablo'] #se obtiene la data del índice indicado (pablo)
#también se puede hacer con serie.loc['pablo']

100

In [57]:
'pablo' in serie #true si se encuentra en la serie

True

In [58]:
serie * 3 #se multiplican todos los valores por 3

pablo    300
ana      600
juan     900
dtype: int64

## Dataframes

In [59]:
#se crea un diccionario
temp_media = {
    'Invierno' : pd.Series(index = ['Madrid', 'Barcelona', 'Sevilla', 'Valencia'], data = [8,18,14,17]),
    'Verano' : pd.Series(index = ['Madrid', 'Barcelona', 'Sevilla', 'Valencia'], data = [37,33,40,34])
}

df = pd.DataFrame(temp_media) #se convierte en dataframe
df

           Invierno  Verano
Madrid            8      37
Barcelona        18      33
Sevilla          14      40
Valencia         17      34

In [60]:
#nueva columna primavera con valores a partir del cálculo de la media de las otras
df['primavera'] = (df['Invierno'] + df['Verano'])/2
df

           Invierno  Verano  primavera
Madrid            8      37       22.5
Barcelona        18      33       25.5
Sevilla          14      40       27.0
Valencia         17      34       25.5

In [61]:
#columna booleana
df['calor en verano'] = df['Verano']>35
df

           Invierno  Verano  primavera  calor en verano
Madrid            8      37       22.5             True
Barcelona        18      33       25.5            False
Sevilla          14      40       27.0             True
Valencia         17      34       25.5            False

In [62]:
#se extrae del df la columna a una variable nueva, también se puede hacer con del df['calor en verano']
calor_en_verano = df.pop('calor en verano')
df

           Invierno  Verano  primavera
Madrid            8      37       22.5
Barcelona        18      33       25.5
Sevilla          14      40       27.0
Valencia         17      34       25.5

In [63]:
#insertar nueva columna con los datos de otra ya existente
df.insert(0, 'copia invierno', df['Invierno'])
df

           copia invierno  Invierno  Verano  primavera
Madrid                  8         8      37       22.5
Barcelona              18        18      33       25.5
Sevilla                14        14      40       27.0
Valencia               17        17      34       25.5

In [64]:
#dataframe seleccionando índices del diccionario
df2 = pd.DataFrame(temp_media, index = ['Madrid', 'Barcelona'])
df2

           Invierno  Verano
Madrid            8      37
Barcelona        18      33

In [65]:
#dataframe seleccionando columnas del diccionario
df3 = pd.DataFrame(temp_media, columns = ['Invierno'])
df3

           Invierno
Madrid            8
Barcelona        18
Sevilla          14
Valencia         17